Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipni</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_file.this["caskadht/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "caskadht"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["cassette/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "cassette"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["dhfind/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "dhfind"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["heyfil/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "heyfil"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["index-observer/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "index-observer"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["index-provider/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "index-provider"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["indexstar/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "indexstar"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["lookout/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "lookout"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["storetheindex/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "storetheindex"
      + sha                 = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->